Revit 2026 API

# GeometryElement Properties

---

The GeometryElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle(Inherited from GeometryObject) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.(Inherited from GeometryObject) |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.(Inherited from GeometryObject) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | MaterialElement | Element describing the material from which this element is composed. |
|  | Visibility | The visibility.(Inherited from GeometryObject) |

#### Reference

GeometryElement Class

Autodesk.Revit.DB Namespace